#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Nokos/terraform-github/runs/run-4WqkTBk75TAK4JFE

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/internal]
azurerm_network_interface.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/networkInterfaces/testTF-nic]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_network_interface.main has changed
  ~ resource "azurerm_network_interface" "main" {
        id                            = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/networkInterfaces/testTF-nic"
        name                          = "testTF-nic"
      + tags                          = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.main has changed
  ~ resource "azurerm_resource_group" "main" {
        id       = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources"
        name     = "testTF-resources"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }

  # azurerm_subnet.internal has changed
  ~ resource "azurerm_subnet" "internal" {
        id                                             = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/internal"
        name                                           = "internal"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_network.main has changed
  ~ resource "azurerm_virtual_network" "main" {
        id                      = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network"
        name                    = "testTF-network"
      ~ subnet                  = [
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/internal"
              + name           = "internal"
              + security_group = ""
            },
        ]
      + tags                    = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_network_interface.main must be replaced
-/+ resource "azurerm_network_interface" "main" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/networkInterfaces/testTF-nic" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "23f3rgdprpsepkxbnrgcm3lj1h.xx.internal.cloudapp.net" -> (known after apply)
      ~ location                      = "westus2" -> "eastus" # forces replacement
      + mac_address                   = (known after apply)
        name                          = "testTF-nic"
      ~ private_ip_address            = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.0.2.4",
        ] -> (known after apply)
      - tags                          = {} -> null
      + virtual_machine_id            = (known after apply)
        # (3 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "internal"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.0.2.4" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_resource_group.main must be replaced
-/+ resource "azurerm_resource_group" "main" {
      ~ id       = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources" -> (known after apply)
      ~ location = "westus2" -> "eastus" # forces replacement
        name     = "testTF-resources"
      - tags     = {} -> null
    }

  # azurerm_virtual_network.main must be replaced
-/+ resource "azurerm_virtual_network" "main" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "98d84be7-8b6f-47e4-aae1-6c4c267569df" -> (known after apply)
      ~ id                      = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network" -> (known after apply)
      ~ location                = "westus2" -> "eastus" # forces replacement
        name                    = "testTF-network"
      ~ subnet                  = [
          - {
              - address_prefix = "10.0.2.0/24"
              - id             = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/internal"
              - name           = "internal"
              - security_group = ""
            },
        ] -> (known after apply)
      - tags                    = {} -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_windows_virtual_machine.main will be created
  + resource "azurerm_windows_virtual_machine" "main" {
      + admin_password             = (sensitive value)
      + admin_username             = "adminuser"
      + allow_extension_operations = true
      + computer_name              = (known after apply)
      + enable_automatic_updates   = true
      + extensions_time_budget     = "PT1H30M"
      + hotpatching_enabled        = true
      + id                         = (known after apply)
      + location                   = "eastus"
      + max_bid_price              = -1
      + name                       = "testTF-vm"
      + network_interface_ids      = (known after apply)
      + patch_mode                 = "AutomaticByPlatform"
      + platform_fault_domain      = -1
      + priority                   = "Regular"
      + private_ip_address         = (known after apply)
      + private_ip_addresses       = (known after apply)
      + provision_vm_agent         = true
      + public_ip_address          = (known after apply)
      + public_ip_addresses        = (known after apply)
      + resource_group_name        = "testTF-resources"
      + size                       = "Standard_F2s_v2"
      + virtual_machine_id         = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition-core"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ resource_group_id = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources" -> (known after apply)

```

</details>

*Pusher: @Nokoshan, Action: `pull_request`*